WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
/****************************************************************************
 *
 *   Copyright (c) 2025 PX4 Development Team. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name PX4 nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/**
 * @file wk2132.c
 * @author PX4 Development Team
 * @brief WK2132 I2C to Quad UART serial driver for NuttX
 *
 * This driver provides serial port functionality for the WK2132 I2C to
 * Quad UART bridge chip, exposing up to 4 additional UART ports as
 * standard /dev/ttyS* devices.
 */

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <errno.h>
#include <debug.h>
#include <termios.h>
#include <stdio.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/serial/serial.h>
#include <nuttx/i2c/i2c_master.h>
#include <nuttx/kmalloc.h>
#include <nuttx/wqueue.h>

#include <arch/board/board.h>

/* Include appropriate STM32 I2C header based on variant */
#if defined(CONFIG_ARCH_CHIP_STM32H7)
#include <stm32_i2c.h>
#elif defined(CONFIG_ARCH_CHIP_STM32F7) || defined(CONFIG_ARCH_CHIP_STM32F4)
#include <stm32_i2c.h>
#elif defined(CONFIG_ARCH_CHIP_STM32F3) || defined(CONFIG_ARCH_CHIP_STM32F1)
#include <stm32_i2c.h>
#else
#error "WK2132: Unsupported STM32 variant"
#endif

#include <px4_arch/wk2132.h>

#include <string.h>  /* For memcpy */

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  wk2132_setup(FAR struct uart_dev_s *dev);
static void wk2132_shutdown(FAR struct uart_dev_s *dev);
static int  wk2132_attach(FAR struct uart_dev_s *dev);
static void wk2132_detach(FAR struct uart_dev_s *dev);
static int  wk2132_ioctl(FAR struct file *filep, int cmd, unsigned long arg);
static int  wk2132_receive(FAR struct uart_dev_s *dev, unsigned int *status);
static void wk2132_rxint(FAR struct uart_dev_s *dev, bool enable);
static bool wk2132_rxavailable(FAR struct uart_dev_s *dev);
static void wk2132_send(FAR struct uart_dev_s *dev, int ch);
static void wk2132_txint(FAR struct uart_dev_s *dev, bool enable);
static bool wk2132_txready(FAR struct uart_dev_s *dev);
static bool wk2132_txempty(FAR struct uart_dev_s *dev);

static int  wk2132_i2c_write(FAR struct wk2132_dev_s *priv, uint8_t reg,
                              uint8_t value);
static int  wk2132_i2c_read(FAR struct wk2132_dev_s *priv, uint8_t reg,
                             FAR uint8_t *value);
static uint8_t wk2132_build_address(uint8_t device_addr, uint8_t uart_ch,
                                    uint8_t reg);
static int  wk2132_set_baud(FAR struct wk2132_dev_s *priv, uint32_t baud);
static void wk2132_poll_worker(FAR void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* UART operations */
static const struct uart_ops_s g_wk2132_uart_ops =
{
  .setup          = wk2132_setup,
  .shutdown       = wk2132_shutdown,
  .attach         = wk2132_attach,
  .detach         = wk2132_detach,
  .ioctl          = wk2132_ioctl,
  .receive        = wk2132_receive,
  .rxint          = wk2132_rxint,
  .rxavailable    = wk2132_rxavailable,
  .send           = wk2132_send,
  .txint          = wk2132_txint,
  .txready        = wk2132_txready,
  .txempty        = wk2132_txempty,
};

/* Work queue for polling */
static struct work_s g_wk2132_poll_work;
static bool g_wk2132_poll_started = false;
static FAR struct uart_dev_s *g_wk2132_devices[WK2132_MAX_PORTS];
static int g_wk2132_device_count = 0;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/**
 * @brief Build I2C address using WK2132 addressing scheme
 * Address format: [A1][A0][1][0][C1][C0][reg_bits]
 * - A1,A0: Device address bits (from IA1,IA0 jumpers)
 * - 1,0: Fixed address prefix  
 * - C1,C0: Channel selection (0-3 for UARTs 1-4)
 * - reg_bits: Register selection bits
 */
static uint8_t wk2132_build_address(uint8_t device_addr, uint8_t uart_ch,
                                    uint8_t reg)
{
  uint8_t address = 0;
  
  /* Extract device address bits A1,A0 from 7-bit device address */
  address |= (device_addr & 0x03) << 6;  /* A1,A0 in bits 7,6 */
  
  /* Add fixed prefix bits [1][0] */
  address |= WK2132_ADDR_PREFIX;         /* Fixed 0x10 in bits 5,4 */
  
  /* Add channel selection C1,C0 (uart_ch 1-4 becomes 0-3) */
  address |= ((uart_ch - 1) & 0x03) << WK2132_UART_SHIFT;
  
  /* Add register bits (lower 2 bits of reg) */
  address |= (reg & WK2132_REG_MASK);
  
  return address;
}

/**
 * @brief Write a register via I2C (legacy private function)
 */
static int wk2132_i2c_write(FAR struct wk2132_dev_s *priv, uint8_t reg,
                             uint8_t value)
{
  return wk2132_reg_write(priv->i2c, priv->addr, priv->port, reg, value);
}

/**
 * @brief Read a register via I2C (legacy private function)
 */
static int wk2132_i2c_read(FAR struct wk2132_dev_s *priv, uint8_t reg,
                            FAR uint8_t *value)
{
  return wk2132_reg_read(priv->i2c, priv->addr, priv->port, reg, value);
}

/**
 * @brief Set baud rate for a UART port
 */
static int wk2132_set_baud(FAR struct wk2132_dev_s *priv, uint32_t baud)
{
  uint32_t divisor;
  uint8_t baud1, baud0, pres;
  int ret;

  /* Calculate baud rate divisor
   * Baud = Crystal_Freq / (PRES * (BAUD1*256 + BAUD0) * 16)
   * For simplicity, we'll use PRES = 1
   */
  divisor = WK2132_CRYSTAL_FREQ / (baud * 16);

  if (divisor > 0xFFFF)
    {
      /* Use prescaler */
      pres = 4;
      divisor = WK2132_CRYSTAL_FREQ / (baud * 16 * 4);
    }
  else
    {
      pres = 1;
    }

  if (divisor > 0xFFFF)
    {
      return -EINVAL;  /* Baud rate too low */
    }

  baud1 = (divisor >> 8) & 0xFF;
  baud0 = divisor & 0xFF;

  /* Select sub-page 1 for baud rate configuration */
  ret = wk2132_i2c_write(priv, WK2132_SPAGE, 1);
  if (ret < 0)
    {
      return ret;
    }

  /* Set baud rate registers */
  ret = wk2132_i2c_write(priv, WK2132_BAUD1, baud1);
  if (ret < 0)
    {
      return ret;
    }

