WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Register UART devices */
  for (i = 0; i < num_ports; i++)
    {
      snprintf(devpath, sizeof(devpath), "/dev/ttyS%d", base_tty + i);
      ret = uart_register(devpath, devs[i]);
      if (ret < 0)
        {
          syslog(LOG_ERR, "WK2132: Failed to register %s\n", devpath);
          goto cleanup;
        }

      syslog(LOG_INFO, "WK2132: Registered %s for port %d\n", devpath, i + 1);
    }

  return OK;

cleanup:
  /* Cleanup on failure */
  for (int j = 0; j < i; j++)
    {
      if (devs[j])
        {
          /* Note: uart_unregister would be called here if it existed */
          /* For now, we'll just free the memory */
          if (devs[j]->xmit.buffer)
            {
              kmm_free(devs[j]->xmit.buffer);
            }
          if (devs[j]->recv.buffer)
            {
              kmm_free(devs[j]->recv.buffer);
            }
          kmm_free(devs[j]->priv);
          kmm_free(devs[j]);
        }
    }

  return ret;
}

/****************************************************************************
 * Public Register and FIFO Functions
 ****************************************************************************/

/**
 * @brief Write to a WK2132 register using proper I2C addressing
 */
int wk2132_reg_write(FAR struct i2c_master_s *i2c, uint8_t device_addr,
                     uint8_t uart_ch, uint8_t reg, uint8_t value)
{
  struct i2c_msg_s msg;
  uint8_t buffer[2];
  uint8_t i2c_addr;
  int ret;

  /* Validate parameters */
  if (!i2c || uart_ch < 1 || uart_ch > WK2132_MAX_PORTS)
    {
      return -EINVAL;
    }

  /* Build proper I2C address according to WK2132 specification */
  i2c_addr = wk2132_build_address(device_addr, uart_ch, reg);
  
  /* Prepare write buffer */
  buffer[0] = reg;      /* Register address */
  buffer[1] = value;    /* Data to write */

  /* Setup I2C message */
  msg.frequency = WK2132_I2C_FREQUENCY;
  msg.addr      = i2c_addr;
  msg.flags     = 0;
  msg.buffer    = buffer;
  msg.length    = 2;

  /* Perform the transfer */
  ret = I2C_TRANSFER(i2c, &msg, 1);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Read from a WK2132 register using proper I2C addressing
 */
int wk2132_reg_read(FAR struct i2c_master_s *i2c, uint8_t device_addr,
                    uint8_t uart_ch, uint8_t reg, FAR uint8_t *value)
{
  struct i2c_msg_s msgs[2];
  uint8_t i2c_addr;
  int ret;

  /* Validate parameters */
  if (!i2c || !value || uart_ch < 1 || uart_ch > WK2132_MAX_PORTS)
    {
      return -EINVAL;
    }

  /* Build proper I2C address according to WK2132 specification */
  i2c_addr = wk2132_build_address(device_addr, uart_ch, reg);

  /* Setup I2C write message for register address */
  msgs[0].frequency = WK2132_I2C_FREQUENCY;
  msgs[0].addr      = i2c_addr;
  msgs[0].flags     = 0;
  msgs[0].buffer    = &reg;
  msgs[0].length    = 1;

  /* Setup I2C read message for data */
  msgs[1].frequency = WK2132_I2C_FREQUENCY;
  msgs[1].addr      = i2c_addr;
  msgs[1].flags     = I2C_M_READ;
  msgs[1].buffer    = value;
  msgs[1].length    = 1;

  /* Perform the transfer */
  ret = I2C_TRANSFER(i2c, msgs, 2);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Write data to WK2132 FIFO
 */
int wk2132_fifo_write(FAR struct i2c_master_s *i2c, uint8_t device_addr,
                      uint8_t uart_ch, FAR const uint8_t *data, size_t len)
{
  struct i2c_msg_s msg;
  uint8_t i2c_addr;
  uint8_t *buffer;
  size_t bytes_written = 0;
  size_t chunk_size;
  int ret;

  /* Validate parameters */
  if (!i2c || !data || len == 0 || uart_ch < 1 || uart_ch > WK2132_MAX_PORTS)
    {
      return -EINVAL;
    }

  /* Build I2C address for FIFO data register */
  i2c_addr = wk2132_build_address(device_addr, uart_ch, WK2132_FDAT);

  /* Allocate buffer for register address + data */
  buffer = kmm_malloc(WK2132_FIFO_SIZE + 1);
  if (!buffer)
    {
      return -ENOMEM;
    }

  /* Write data in chunks to respect FIFO size limits */
  while (bytes_written < len)
    {
      /* Determine chunk size (FIFO capacity or remaining data) */
      chunk_size = (len - bytes_written);
      if (chunk_size > WK2132_FIFO_SIZE)
        {
          chunk_size = WK2132_FIFO_SIZE;
        }

      /* Prepare buffer: register address followed by data */
      buffer[0] = WK2132_FDAT;
      memcpy(&buffer[1], &data[bytes_written], chunk_size);

      /* Setup I2C message */
      msg.frequency = WK2132_I2C_FREQUENCY;
      msg.addr      = i2c_addr;
      msg.flags     = 0;
      msg.buffer    = buffer;
      msg.length    = chunk_size + 1;

      /* Perform the transfer */
      ret = I2C_TRANSFER(i2c, &msg, 1);
      if (ret < 0)
        {
          break;
        }

      bytes_written += chunk_size;
    }

  kmm_free(buffer);
  return (ret >= 0) ? bytes_written : ret;
}

/**
 * @brief Read data from WK2132 FIFO
 */
int wk2132_fifo_read(FAR struct i2c_master_s *i2c, uint8_t device_addr,
                     uint8_t uart_ch, FAR uint8_t *data, size_t len)
{
  struct i2c_msg_s msgs[2];
  uint8_t i2c_addr;
  uint8_t reg_addr;
  uint8_t fifo_count;
  size_t bytes_to_read;
  int ret;

  /* Validate parameters */
  if (!i2c || !data || len == 0 || uart_ch < 1 || uart_ch > WK2132_MAX_PORTS)
    {
      return -EINVAL;
    }

  /* First, check how many bytes are available in RX FIFO */
  ret = wk2132_reg_read(i2c, device_addr, uart_ch, WK2132_RFCNT, &fifo_count);
  if (ret < 0)
    {
      return ret;
    }

  /* Determine how many bytes to actually read */
  bytes_to_read = (fifo_count < len) ? fifo_count : len;
  if (bytes_to_read == 0)
    {
      return 0; /* No data available */
    }

  /* Build I2C address for FIFO data register */
  i2c_addr = wk2132_build_address(device_addr, uart_ch, WK2132_FDAT);
  reg_addr = WK2132_FDAT;

  /* Setup I2C write message for register address */
  msgs[0].frequency = WK2132_I2C_FREQUENCY;
  msgs[0].addr      = i2c_addr;
  msgs[0].flags     = 0;
  msgs[0].buffer    = &reg_addr;
  msgs[0].length    = 1;

  /* Setup I2C read message for data */
  msgs[1].frequency = WK2132_I2C_FREQUENCY;
  msgs[1].addr      = i2c_addr;
  msgs[1].flags     = I2C_M_READ;
  msgs[1].buffer    = data;
  msgs[1].length    = bytes_to_read;

  /* Perform the transfer */
  ret = I2C_TRANSFER(i2c, msgs, 2);
  return (ret >= 0) ? bytes_to_read : ret;
}
